<template>
  <div class="conent">
    <!-- 文章详情页面 -->
    <div v-html="html"></div>
  </div>
</template>

<script lang="ts">
import { reactive, toRefs, onMounted } from 'vue'
import { useRoute } from 'vue-router'
import { getArticleInfo } from 'src/apis/index'

export default {
  name: 'articleDetails',
  setup() {
    const $route = useRoute();

    const state = reactive({
      count: 0,
      html: '<h4 class="_1RuRku">忆童年田园生活（13）回味“露天电影”</h4><article class="_2rhmJa"><p>如果有人问我最好看的电影是什么？我会来个脑筋急转弯，俏皮地回道：“是露天电影。”，说到露天电影，也许会勾起不少人的美好回忆吧。此刻，我的思绪也立马回到了童年时有关“露天电影”的记忆。<br></p><p>那时的乡村生活还没有电视，而每年难得一两次的露天电影是我美好童年最记忆犹新的事。每次盼着放电影的热切心理比盼着过年还强烈，只要知晓哪天要放电影了，那几天我便扳着手指过日子，有时连做梦都在做赶场看电影的事。</p><p>当好不容易盼到放映的那一天， 我便会早早起床，跟妈妈要点零花钱，跑到离村较远的公社去买些爆米花、蚕豆、糖之类的零食，那用牛皮纸包装的美味零食可是那时的奢侈品呀。傍晚时分，妈妈会提前做好晚饭，我狼吞虎咽地扒完饭后就抱着小板凳跑去占位置了，其实那时离放映的时间还有很长一段时间，可草坪上早已坐满了黑压压的人群。</p><p>对于美好事物的向往，即使是焦急地等待也是欢喜的。等呀，等呀，当屏幕闪现着光亮时，我的心情也随着亮了起来，大家的欢呼声一阵高过一阵，但随着音响蹦出的声音，很快就让大家安静下来去凝神观望着。</p><p>我还记得那时观看的第一部露天电影叫《孙悟空》，孙悟空的七十二变变得我眼花缭乱，简直不敢相信孙悟空可以那么神通广大，还幻想着自己也有那些本领该多好，若变成了蜜蜂就可以去采花蜜酿蜂蜜了；若能“腾云驾雾”，我就可以随时到旁边的山上去采摘野果吃，还可随时摇变成仙女飘来飘去，过上神仙般的日子......正当我想得美滋滋之时，母亲在一旁猛唤我吃美味零食呢，一下子就把我拉回了现实。耳边的蛙叫声也此起彼伏，好像在取笑我说：“小姑娘在异想天开吧。”我毫不理会，继续边吃着难得的零食，边瞪大着双眼继续观看孙悟空如何变身打妖怪。</p><p>后来还陆续观看了抗战片，如《地道战》《鸡毛信》《铁道游击队》等影片让我对抗战英雄有了崇敬之情。《阿诗玛》《刘三姐》等影片让我对女性的美与智慧有了羡慕之情。我每次都观看得很投入，跟着剧情时而紧张，时而欢喜，时而悲伤，而且每次都会让我观看得流连忘返，并苦苦期盼着下次的放映。</p><p> </p></article>'
    })
    onMounted(() => {
      let params = {
        id: Number($route.query.id)
      }
      console.log(params);

      getArticleInfo(params).then((res: any) => {
        console.log(res);
      })
    })
    return {
      ...toRefs(state),
    }
  }
}
</script>

<style lang="scss" scoped></style>
